lib/holiday-stops/src/test/resources/DeliveryEveryDatePlusSubscription.json

{
  "success": true,
  "id": "2c92a00d6d8c7127016d9138a1de18e9",
  "accountId": "2c92a0ff58bdf4eb0158feffbafc5af7",
  "accountNumber": "320822",
  "accountName": "320822",
  "invoiceOwnerAccountId": "2c92a0ff58bdf4eb0158feffbafc5af7",
  "invoiceOwnerAccountNumber": "320822",
  "invoiceOwnerAccountName": "320822",
  "subscriptionNumber": "A-S00912060",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2019-10-03",
  "serviceActivationDate": "2019-10-03",
  "customerAcceptanceDate": "2019-10-06",
  "subscriptionStartDate": "2019-10-03",
  "termStartDate": "2019-10-03",
  "termEndDate": "2020-10-03",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 67.12,
  "totalContractedValue": 798.73,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "OpportunityName__QT": null,
  "Gift_Subscription__c": null,
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": "CSR",
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "QuoteType__QT": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": "5000J00001bxO2YQAU",
  "ReaderType__c": null,
  "ActivationDate__c": "2019-10-03T13:07:31.015",
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "ratePlans": [
    {
      "id": "2c92a00d6d8c7127016d9138a1b418e2",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff64176cd40164232c8ec97661",
      "ratePlanName": "Cancellation Save Discount - 25% off for 3 months",
      "ratePlanCharges": [
        {
          "id": "2c92a00d6d8c7127016d9138a1b418e3",
          "originalChargeId": "2c92a00d6d8c7127016d9138a1b418e3",
          "productRatePlanChargeId": "2c92a0ff64176cd40164232c8eda7664",
          "number": "C-01695020",
          "name": "25% discount on subscription for 3 months",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "pricingSummary": "25%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": null,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 25.000000000,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-07-06",
          "effectiveEndDate": "2020-10-03",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 3,
          "specificEndDate": null,
          "mrr": 0E-9,
          "dmrc": 0E-9,
          "tcv": 0E-9,
          "dtcv": 0E-9,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "2c92a00d6d8c7127016d9138a1ff18ed",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff64176cd40164232c8ec97661",
      "ratePlanName": "Cancellation Save Discount - 25% off for 3 months",
      "ratePlanCharges": [
        {
          "id": "2c92a00d6d8c7127016d9138a1ff18ee",
          "originalChargeId": "2c92a00e6d8c6370016d91381d834232",
          "productRatePlanChargeId": "2c92a0ff64176cd40164232c8eda7664",
          "number": "C-01695019",
          "name": "25% discount on subscription for 3 months",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "pricingSummary": "25%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": null,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 25.000000000,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-04-06",
          "effectiveEndDate": "2020-07-06",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 3,
          "specificEndDate": null,
          "mrr": 0E-9,
          "dmrc": 0E-9,
          "tcv": 0E-9,
          "dtcv": 0E-9,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "2c92a00d6d8c7127016d9138a21518f2",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff64176cd40164232c8ec97661",
      "ratePlanName": "Cancellation Save Discount - 25% off for 3 months",
      "ratePlanCharges": [
        {
          "id": "2c92a00d6d8c7127016d9138a21518f3",
          "originalChargeId": "2c92a00a6d8c63eb016d9137dd17141b",
          "productRatePlanChargeId": "2c92a0ff64176cd40164232c8eda7664",
          "number": "C-01695018",
          "name": "25% discount on subscription for 3 months",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "pricingSummary": "25%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": null,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 25.000000000,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-01-06",
          "effectiveEndDate": "2020-04-06",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 3,
          "specificEndDate": null,
          "mrr": 0E-9,
          "dmrc": 0E-9,
          "tcv": 0E-9,
          "dtcv": 0E-9,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "2c92a00d6d8c7127016d9138a22718f7",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff64176cd40164232c8ec97661",
      "ratePlanName": "Cancellation Save Discount - 25% off for 3 months",
      "ratePlanCharges": [
        {
          "id": "2c92a00d6d8c7127016d9138a22718f8",
          "originalChargeId": "2c92a0ff6d8c7188016d91377b120fbf",
          "productRatePlanChargeId": "2c92a0ff64176cd40164232c8eda7664",
          "number": "C-01695017",
          "name": "25% discount on subscription for 3 months",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "pricingSummary": "25%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": null,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 25.000000000,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-06",
          "effectiveEndDate": "2020-01-06",
          "processedThroughDate": "2019-12-06",
          "chargedThroughDate": "2020-01-06",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 3,
          "specificEndDate": null,
          "mrr": 0E-9,
          "dmrc": 0E-9,
          "tcv": 0E-9,
          "dtcv": 0E-9,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "2c92a00d6d8c7127016d9138a280190a",
      "productId": "2c92a0ff55a0e4940155dfa589da2591",
      "productName": "Newspaper Delivery",
      "productSku": "ABC-00000013",
      "productRatePlanId": "2c92a0fd560d132301560e43cf041a3c",
      "ratePlanName": "Everyday+",
      "ratePlanCharges": [
        {
          "id": "2c92a00d6d8c7127016d9138a2801912",
          "originalChargeId": "2c92a0fd6d8c715c016d912eed9a4111",
          "productRatePlanChargeId": "2c92a0ff560d311c0156136573e366f3",
          "number": "C-01695009",
          "name": "Saturday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP10.85",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 10.850000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-06",
          "effectiveEndDate": "2020-10-03",
          "processedThroughDate": "2019-12-06",
          "chargedThroughDate": "2020-01-06",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.850000000,
          "dmrc": 10.850000000,
          "tcv": 129.115000000,
          "dtcv": 129.115000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "2c92a00d6d8c7127016d9138a280190b",
          "originalChargeId": "2c92a0fd6d8c715c016d912eed9a410a",
          "productRatePlanChargeId": "2c92a0fc560d13390156136324931d21",
          "number": "C-01695002",
          "name": "Wednesday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP8.16",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 8.160000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-06",
          "effectiveEndDate": "2020-10-03",
          "processedThroughDate": "2019-12-06",
          "chargedThroughDate": "2020-01-06",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 8.160000000,
          "dmrc": 8.160000000,
          "tcv": 97.104000000,
          "dtcv": 97.104000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "2c92a00d6d8c7127016d9138a2801911",
          "originalChargeId": "2c92a0fd6d8c715c016d912eed9a4110",
          "productRatePlanChargeId": "2c92a0ff560d311b015613623e050a63",
          "number": "C-01695008",
          "name": "Tuesday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP8.16",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 8.160000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-06",
          "effectiveEndDate": "2020-10-03",
          "processedThroughDate": "2019-12-06",
          "chargedThroughDate": "2020-01-06",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 8.160000000,
          "dmrc": 8.160000000,
          "tcv": 97.104000000,
          "dtcv": 97.104000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "2c92a00d6d8c7127016d9138a280190e",
          "originalChargeId": "2c92a0fd6d8c715c016d912eed9a410d",
          "productRatePlanChargeId": "2c92a0fe560d3104015613640f555223",
          "number": "C-01695005",
          "name": "Thursday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP8.16",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 8.160000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-06",
          "effectiveEndDate": "2020-10-03",
          "processedThroughDate": "2019-12-06",
          "chargedThroughDate": "2020-01-06",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 8.160000000,
          "dmrc": 8.160000000,
          "tcv": 97.104000000,
          "dtcv": 97.104000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "2c92a00d6d8c7127016d9138a280190f",
          "originalChargeId": "2c92a0fd6d8c715c016d912eed9a410e",
          "productRatePlanChargeId": "2c92a0fe560d31040156136626dd5d1b",
          "number": "C-01695006",
          "name": "Sunday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP11.14",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 11.140000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-06",
          "effectiveEndDate": "2020-10-03",
          "processedThroughDate": "2019-12-06",
          "chargedThroughDate": "2020-01-06",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 11.140000000,
          "dmrc": 11.140000000,
          "tcv": 132.566000000,
          "dtcv": 132.566000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "2c92a00d6d8c7127016d9138a280190c",
          "originalChargeId": "2c92a0fd6d8c715c016d912eed9a410b",
          "productRatePlanChargeId": "2c92a0fd560d132901561367b2f17763",
          "number": "C-01695003",
          "name": "Digital Pack",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP4.33",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 4.330000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-06",
          "effectiveEndDate": "2020-10-03",
          "processedThroughDate": "2019-12-06",
          "chargedThroughDate": "2020-01-06",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 4.330000000,
          "dmrc": 4.330000000,
          "tcv": 51.527000000,
          "dtcv": 51.527000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "2c92a00d6d8c7127016d9138a280190d",
          "originalChargeId": "2c92a0fd6d8c715c016d912eed9a410c",
          "productRatePlanChargeId": "2c92a0fd560d138801561364cad96af7",
          "number": "C-01695004",
          "name": "Friday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP8.16",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 8.160000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-06",
          "effectiveEndDate": "2020-10-03",
          "processedThroughDate": "2019-12-06",
          "chargedThroughDate": "2020-01-06",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 8.160000000,
          "dmrc": 8.160000000,
          "tcv": 97.104000000,
          "dtcv": 97.104000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "2c92a00d6d8c7127016d9138a2801910",
          "originalChargeId": "2c92a0fd6d8c715c016d912eed9a410f",
          "productRatePlanChargeId": "2c92a0ff560d31190156134be59060f4",
          "number": "C-01695007",
          "name": "Monday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP8.16",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 8.160000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-06",
          "effectiveEndDate": "2020-10-03",
          "processedThroughDate": "2019-12-06",
          "chargedThroughDate": "2020-01-06",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 8.160000000,
          "dmrc": 8.160000000,
          "tcv": 97.104000000,
          "dtcv": 97.104000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}